book_collection_1/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at", "author", "price", "published_date") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
      @book = Book.new(book_params)

      respond_to do |format|
        if @book.save