app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Excited for Fall 2023"], ["created_at", "2023-08-25 18:14:37.367680"], ["updated_at", "2023-08-25 18:14:37.367680"]]
---
    def create
      @book = Book.new(book_params)
      if @book.save